In [1]:
%load_ext sql

In [2]:
%sql postgresql://postgres:070804@localhost:5432/testdb_1

In [4]:
%sql select first_name, last_name from actor limit 10;

 * postgresql://postgres:***@localhost:5432/testdb_1
10 rows affected.

[('Penelope', 'Guiness'),
 ('Nick', 'Wahlberg'),
 ('Ed', 'Chase'),
 ('Jennifer', 'Davis'),
 ('Johnny', 'Lollobrigida'),
 ('Bette', 'Nicholson'),
 ('Grace', 'Mostel'),
 ('Matthew', 'Johansson'),
 ('Joe', 'Swank'),
 ('Christian', 'Gable')]

%% is used for multiple lines
limit is used to upperbiund select rows

In [6]:
%sql select FIRST_NAME, last_Name from actor limit 5;

 * postgresql://postgres:***@localhost:5432/testdb_1
5 rows affected.

[('Penelope', 'Guiness'),
 ('Nick', 'Wahlberg'),
 ('Ed', 'Chase'),
 ('Jennifer', 'Davis'),
 ('Johnny', 'Lollobrigida')]

In [5]:
%sql select title, description from film limit 5;

 * postgresql://postgres:***@localhost:5432/testdb_1
5 rows affected.

[('Chamber Italian', 'A Fateful Reflection of a Moose And a Husband who must Overcome a Monkey in Nigeria'),
 ('Grosse Wonderful', 'A Epic Drama of a Cat And a Explorer who must Redeem a Moose in Australia'),
 ('Airport Pollock', 'A Epic Tale of a Moose And a Girl who must Confront a Monkey in Ancient India'),
 ('Bright Encounters', 'A Fateful Yarn of a Lumberjack And a Feminist who must Conquer a Student in A Jet Boat'),
 ('Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies')]

Q2 Exercise

In [7]:
%sql select name from language;

 * postgresql://postgres:***@localhost:5432/testdb_1
6 rows affected.

[('English             ',),
 ('Italian             ',),
 ('Japanese            ',),
 ('Mandarin            ',),
 ('French              ',),
 ('German              ',)]

In [9]:
%sql select rating from film limit 5;

 * postgresql://postgres:***@localhost:5432/testdb_1
5 rows affected.

[('NC-17',), ('R',), ('R',), ('PG-13',), ('PG',)]

In [10]:
%sql select distinct rating from film;

 * postgresql://postgres:***@localhost:5432/testdb_1
5 rows affected.

[('PG-13',), ('PG',), ('R',), ('G',), ('NC-17',)]

In [12]:
%sql select * from customer limit 5;

 * postgresql://postgres:***@localhost:5432/testdb_1
5 rows affected.

[(524, 1, 'Jared', 'Ely', 'jared.ely@sakilacustomer.org', 530, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (1, 1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', 5, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (2, 1, 'Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', 6, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (3, 1, 'Linda', 'Williams', 'linda.williams@sakilacustomer.org', 7, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (4, 2, 'Barbara', 'Jones', 'barbara.jones@sakilacustomer.org', 8, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1)]

In [13]:
%sql select '123';

 * postgresql://postgres:***@localhost:5432/testdb_1
1 rows affected.

[('123',)]

In [16]:
%sql select '123' as foo;

 * postgresql://postgres:***@localhost:5432/testdb_1
1 rows affected.

[('123',)]

In [15]:
%sql select '2006' from film limit 5;

 * postgresql://postgres:***@localhost:5432/testdb_1
5 rows affected.

[('2006',), ('2006',), ('2006',), ('2006',), ('2006',)]

In [17]:
%%sql select customer_id, payment_date, amount, amount*10 as inflated_amount 
from payment limit 10;

 * postgresql://postgres:***@localhost:5432/testdb_1
10 rows affected.

[(341, datetime.datetime(2007, 2, 15, 22, 25, 46, 996577), Decimal('7.99'), Decimal('79.90')),
 (341, datetime.datetime(2007, 2, 16, 17, 23, 14, 996577), Decimal('1.99'), Decimal('19.90')),
 (341, datetime.datetime(2007, 2, 16, 22, 41, 45, 996577), Decimal('7.99'), Decimal('79.90')),
 (341, datetime.datetime(2007, 2, 19, 19, 39, 56, 996577), Decimal('2.99'), Decimal('29.90')),
 (341, datetime.datetime(2007, 2, 20, 17, 31, 48, 996577), Decimal('7.99'), Decimal('79.90')),
 (341, datetime.datetime(2007, 2, 21, 12, 33, 49, 996577), Decimal('5.99'), Decimal('59.90')),
 (342, datetime.datetime(2007, 2, 17, 23, 58, 17, 996577), Decimal('5.99'), Decimal('59.90')),
 (342, datetime.datetime(2007, 2, 20, 2, 11, 44, 996577), Decimal('5.99'), Decimal('59.90')),
 (342, datetime.datetime(2007, 2, 20, 13, 57, 39, 996577), Decimal('2.99'), Decimal('29.90')),
 (343, datetime.datetime(2007, 2, 16, 0, 10, 50, 996577), Decimal('4.99'), Decimal('49.90'))]

In [18]:
%%sql
select film_id, title
from film
where release_year >= 2005 limit 5;

 * postgresql://postgres:***@localhost:5432/testdb_1
5 rows affected.

[(133, 'Chamber Italian'),
 (384, 'Grosse Wonderful'),
 (8, 'Airport Pollock'),
 (98, 'Bright Encounters'),
 (1, 'Academy Dinosaur')]

In [20]:
%%sql select film_id, title
from film
where rating = 'PG-13' and rental_duration > 5 limit 5;

 * postgresql://postgres:***@localhost:5432/testdb_1
5 rows affected.

[(7, 'Airplane Sierra'),
 (18, 'Alter Victory'),
 (36, 'Argonauts Town'),
 (64, 'Beethoven Exorcist'),
 (81, 'Blindness Gun')]

In [22]:
%%sql select rental.rental_id, rental.rental_date, payment.amount
from rental, payment
where rental.rental_id = payment.rental_id limit 5;

 * postgresql://postgres:***@localhost:5432/testdb_1
5 rows affected.

[(1520, datetime.datetime(2005, 6, 15, 23, 57, 20), Decimal('7.99')),
 (1778, datetime.datetime(2005, 6, 16, 18, 54, 48), Decimal('1.99')),
 (1849, datetime.datetime(2005, 6, 17, 0, 13, 19), Decimal('7.99')),
 (2829, datetime.datetime(2005, 6, 19, 21, 11, 30), Decimal('2.99')),
 (3130, datetime.datetime(2005, 6, 20, 19, 3, 22), Decimal('7.99'))]

In [25]:
%%sql select title, name 
from film, film_category, category 
where film.film_id = film_category.film_id 
    and film_category.category_id = category.category_id 
    and name = 'Action' limit 5;

 * postgresql://postgres:***@localhost:5432/testdb_1
5 rows affected.

[('Amadeus Holy', 'Action'),
 ('American Circus', 'Action'),
 ('Antitrust Tomatoes', 'Action'),
 ('Ark Ridgemont', 'Action'),
 ('Barefoot Manchurian', 'Action')]

In [27]:
%%sql select distinct X.title
from film as X, film Y
where X.length > Y.length and Y.rating = 'PG' limit 5;

 * postgresql://postgres:***@localhost:5432/testdb_1
5 rows affected.

[('Academy Dinosaur',),
 ('Ace Goldfinger',),
 ('Adaptation Holes',),
 ('Affair Prejudice',),
 ('African Egg',)]

In [28]:
%%sql select rating, count(*)
from film
group by rating

 * postgresql://postgres:***@localhost:5432/testdb_1
5 rows affected.

[('PG-13', 223), ('PG', 194), ('R', 195), ('G', 178), ('NC-17', 210)]

In [30]:
%%sql select customer_id, count(*)
from rental
group by customer_id
order by count desc
limit 5

 * postgresql://postgres:***@localhost:5432/testdb_1
5 rows affected.

[(148, 46), (526, 45), (236, 42), (144, 42), (75, 41)]

natural join looks at all colums with same name